# DataFrames

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("madison.csv")

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df

   agency_id   agency         2015         2016         2017         2018
0          5   police  68063468.77  71325756.15  73247947.66  77875535.04
1          6     fire  49737578.77  51968340.48  53144053.32  55215007.26
2          9  library  16965434.25  18125521.39  19136347.73  19845065.80
3         12    parks  18371421.04  19159243.28  19316837.02  19760710.00
4         15  streets  25368879.94  28228621.80  26655754.42  27798933.74

In [5]:
df.iat[-1, -1]

27798933.74000001

In [6]:
df.at[3, "2016"]

19159243.279999994

In [7]:
df.set_index("agency_id").at[9, "2017"]

19136347.73

In [8]:
df = df.set_index("agency_id")
df

            agency         2015         2016         2017         2018
agency_id
5           police  68063468.77  71325756.15  73247947.66  77875535.04
6             fire  49737578.77  51968340.48  53144053.32  55215007.26
9          library  16965434.25  18125521.39  19136347.73  19845065.80
12           parks  18371421.04  19159243.28  19316837.02  19760710.00
15         streets  25368879.94  28228621.80  26655754.42  27798933.74

In [9]:
df = df.reset_index().set_index("agency")
df

         agency_id         2015         2016         2017         2018
agency
police           5  68063468.77  71325756.15  73247947.66  77875535.04
fire             6  49737578.77  51968340.48  53144053.32  55215007.26
library          9  16965434.25  18125521.39  19136347.73  19845065.80
parks           12  18371421.04  19159243.28  19316837.02  19760710.00
streets         15  25368879.94  28228621.80  26655754.42  27798933.74

In [10]:
df.loc["fire", "2018"]

55215007.26000002

In [11]:
df2 = df.loc[:, "2016":]
df2

                2016         2017         2018
agency
police   71325756.15  73247947.66  77875535.04
fire     51968340.48  53144053.32  55215007.26
library  18125521.39  19136347.73  19845065.80
parks    19159243.28  19316837.02  19760710.00
streets  28228621.80  26655754.42  27798933.74

In [12]:
df2 = df2 / 1000000
df2

              2016       2017       2018
agency
police   71.325756  73.247948  77.875535
fire     51.968340  53.144053  55.215007
library  18.125521  19.136348  19.845066
parks    19.159243  19.316837  19.760710
streets  28.228622  26.655754  27.798934

In [13]:
df2["2016"] # pull out a column

agency
police     71.325756
fire       51.968340
library    18.125521
parks      19.159243
streets    28.228622
Name: 2016, dtype: float64

In [14]:
df2.loc["library"] # pull out a row if only one value is given

2016    18.125521
2017    19.136348
2018    19.845066
Name: library, dtype: float64

In [15]:
# show rows for all agencies that spent <$20 million in 2018
df2["2018"] < 20

agency
police     False
fire       False
library     True
parks       True
streets    False
Name: 2018, dtype: bool

In [16]:
df2[df2["2018"] < 20]

              2016       2017       2018
agency
library  18.125521  19.136348  19.845066
parks    19.159243  19.316837  19.760710

In [17]:
df2

              2016       2017       2018
agency
police   71.325756  73.247948  77.875535
fire     51.968340  53.144053  55.215007
library  18.125521  19.136348  19.845066
parks    19.159243  19.316837  19.760710
streets  28.228622  26.655754  27.798934

In [18]:
df2.mean(axis=0) # 0 means down (per col)

2016    37.761497
2017    38.300188
2018    40.099050
dtype: float64

In [19]:
df2.mean(axis=1) # 1 means across (per row)

agency
police     74.149746
fire       53.442467
library    19.035645
parks      19.412263
streets    27.561103
dtype: float64